[
  {
    "uid": 1,
    "name": "YRC - Youth Red Cross",
    "logo": "",
    "motto": "Empowering Youth for Humanity",
    "club_email": "youthredcross@bmu.edu.in",
    "phone": 8950180305,
    "about": "The Youth Red Cross (YRC) is more than just a club—it’s a community of passionate, like-minded young individuals united by the spirit of compassion and service. At BML Munjal University, YRC is a space where students come together to extend a helping hand to those in need, while also growing as empathetic and responsible leaders. Through a variety of initiatives, such as blood donation drives, health camps, and educational workshops, the club strives to make a meaningful difference in people’s lives. With each activity, members experience the joy of giving, learn the importance of selflessness, and work towards building a world where humanity comes first.",
    "whyus": "Joining the Youth Red Cross is an opportunity to become part of something truly beautiful. It’s a chance to give back, to light up someone’s life, and to be part of a family that stands for kindness and solidarity. As a YRC member, you will be able to channel your energy and passion into actions that bring hope and change. Whether it’s comforting someone in a time of need, spreading awareness, or organizing impactful events, every small effort counts. You’ll find yourself surrounded by inspiring individuals and, more importantly, discover the immense satisfaction that comes from being a source of strength and positivity in someone else’s story.",
    "milestones": "The Youth Red Cross (YRC) Club has achieved several significant milestones that reflect its dedication to community service and youth empowerment. The club successfully organized two large-scale blood donation camps, with the first witnessing 201 donors and the second seeing an impressive turnout of 270 donors, contributing immensely to local blood banks. Additionally, YRC hosted an impactful PCOD/PCOS awareness workshop, a free eye check-up camp for the campus, and a life-saving CPR workshop to train students and staff in emergency response. The club also had the honor of participating in  state-level YRC training camps for both boys and girls to enhance leadership, first aid, and disaster management skills among young volunteers, thereby nurturing the next generation of compassionate leaders.",
    "president_email": "kanishka.bansal.22bbl@bmu.edu.in",
    "vp_email": "akansha.srivastava.23cse@bmu.edu.in",
    "insta": "http://instagram.com/yrc.bmu",
    "linkedin": "http://linkedin.com/company/yrc-bmu"
  },
  {
    "uid": 2,
    "name": "Finonomics Club",
    "logo": "",
    "motto": "Promoting financial literacy among BMU students.",
    "club_email": "finonomics@bmu.edu.in",
    "phone": 6397011402,
    "about": "The finance club with a sense of humor and a love for money! We navigate the exciting world of finance and economics, with a dash of fun and a pinch of wit. From capturing the latest market trends with the use of technical tools, mind blowing articles on finance and economics, in-depth company overview through fundamental analysis, debates on current topics and many workshops on budgeting and investment strategies which will encompasses the whole universe of managing individual and family finances to improve your current and future financial situation and setting financial goals, we have got it all. These activities and workshop will enhance your skills, gives you a comprehensive perspective to apply practical approach. ",
    "whyus": "A finance and economics club not only enriches your academic journey but also assists you in understanding the complexities of personal financial management. It offers a unique opportunity to enhance your understanding of complex financial concepts and economic principles in a collaborative environment. Engaging with like-minded peers fosters networking and mentorship, allowing you to build valuable connections in the industry. The club often hosts guest speakers, workshops, and hands-on projects, providing practical experience that complements classroom learning.\r\n\r\nParticipating in discussions about current market trends, investment strategies, and economic policies sharpens critical thinking skills and prepares you for real-world challenges. Additionally, involvement in competitions, such as stock market simulations, boosts analytical abilities and teamwork.\r\n\r\nOverall, it helps you building practical approach needed to sustain in a business as we believe finance is a story that revolves around number and is needed to sustain in life and business. It’s a space to explore your interests, gain insights from experts, and develop a strong foundation for future endeavors in the financial world.",
    "milestones": "1) Successfully organized inter-college Stock Trading Simulation event with the highest number of registrations in the college.\r\n2) Flagship event - SheRise that highlighted the business and achievements of rural women entrepreneurs. Finance domain students assisted those businesses to maximize their profits.\r\n3) Famous finance influencers gave guests lecturers in the event \"Wealth Matrix\".\r\n\r\n",
    "president_email": "vaishnavi.garg.23mb@bmu.edu.in",
    "vp_email": "abhinav.mangal.23mb@bmu.edu.in",
    "flagship_events": "Market Masters\r\nWealth Matrix\r\n",
    "insta": "https://www.instagram.com/finonomics_bmu?igsh=czcyN2drcm0wcm5u",
    "linkedin": "linkedin.com/company/finonomics-club"
  },
  {
    "uid": 3,
    "name": "Agraga - The HR & IR Club",
    "logo": "",
    "motto": "Where leadership meets excellence!",
    "club_email": "agraga@bmu.edu.in",
    "phone": 8003495372,
    "about": "Agraga - the HR & IR Club at BML Munjal University, is dedicated to fostering leadership and professional development for all students, not just those pursuing HR or IR careers. \"Agraga,\" meaning \"leader\" in Sanskrit, reflects the club’s mission to nurture the leaders of tomorrow by honing essential skills such as teamwork, communication, and strategic thinking. Though the club is just one year old, it has quickly established itself as a hub for learning, collaboration, and leadership development.\r\n\r\nAgraga offers a range of initiatives designed to spread awareness about HR and IR concepts, while also equipping students with skills applicable across various industries. Through sessions, workshops, group discussions, interviews, and competitions, the club promotes a holistic learning experience for all students. Whether it’s an online, offline, or hybrid event, Agraga ensures that members are engaged in practical learning that prepares them for future leadership roles.\r\n\r\nLooking ahead, the club has ambitious plans to conduct national-level B-school competitions, bringing together students from across the country to test their knowledge and skills. Agraga aims to provide an inclusive platform where every student can grow, learn, and contribute to shaping the future workforce, making it a vital part of the BML Munjal University community.\r\n\r\n",
    "whyus": "Joining Agraga offers all students—not just HR and IR enthusiasts—a platform to develop essential leadership skills and gain exposure to the latest industry trends. As a club focused on fostering personal and professional growth, Agraga provides access to workshops, discussions, and national competitions that enhance problem-solving and communication abilities.\r\n\r\nBeyond its academic offerings, Agraga creates a collaborative environment where students can engage, learn, and network, preparing them for leadership roles in any field. This is a unique opportunity to be part of a dynamic community that is committed to shaping tomorrow’s leaders.",
    "milestones": "In just one year, Agraga has successfully organized a variety of impactful events, creating a lasting impression on the student community. One of the key highlights was the Public Sector Undertakings (PSU) Summit Visit, which provided students with real-world exposure to public sector dynamics. Another notable milestone was the Hero plant visit, offering insights into industrial practices and operations.\r\n\r\nAgraga has also hosted thought-provoking events, such as the Panel Discussion on Employees' Growth and Development and HR Connect: Experience of Leading Professionals, where industry experts shared valuable insights with students. On campus, the club held Aagman, an introductory event, and organized creative competitions like the Logo Making Competition and the fun-filled Corporate Premier League.\r\n\r\nEngagement activities like HR Bingers, the exciting Agraga Carnival - Find Your Prom, and the collaborative dance event Boogie-Woogie have further enriched the club's diverse portfolio of events. These milestones reflect Agraga’s commitment to creating a well-rounded learning and leadership development experience.",
    "president_email": "shreya.saxena.23mb@bmu.edu.in",
    "vp_email": "ashutosh.acharya.23mb@bmu.edu.in",
    "flagship_events": "Corporate Premier League",
    "insta": "https://www.instagram.com/agraga_bmu?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==",
    "linkedin": "https://www.linkedin.com/company/agraga-the-hr-ir-club/"
  },
  {
    "uid": 4,
    "name": "SMC - Social Media Club",
    "logo": "",
    "motto": "Where Campus Events meets Social Media Magic",
    "club_email": "smc.club@bmu.edu.in",
    "phone": 8303841168,
    "about": "Our Social Media Club is dedicated to bringing students together through a vibrant mix of events and digital creativity. From the strategic thrills of the IPL Auction, the runway glamour of Fashion Crave,  and the playful yet mindful fun of Flames of Games, to the exciting social atmosphere of our Offline games, we create experiences that unite, inspire, and entertain.\r\n\r\nOur motto reflects our mission to \"Connect Campus\" by fostering a strong sense of community both online and offline, \"Amplify Voices\" by giving students a platform to express themselves, and \"Inspire Creativity\" by encouraging them to think outside the box—whether in fashion, gaming, or digital content creation. Through these engaging activities, we aim to make social media and campus life not just exciting, but also meaningful and inclusive for everyone.\r\n\r\n",
    "whyus": "The Social Media Club is the perfect place to explore your creativity, whether you're into social media, fashion, or gaming. By taking part in events like the IPL Auction, Fashion Crave, and Flames of Games, you'll gain valuable hands-on experience in event management and digital marketing. It’s also a great way to build essential skills like teamwork and social media strategy, while expanding your network with peers and professionals. Along with fun activities like Tambola Nights and movie screenings, the club offers a chance to make new friends, enjoy unique experiences, and grow both personally and creatively.",
    "milestones": "Over the past year, our social media club has experienced remarkable growth, expanding our Instagram follower base from 350 to 1200, making us the most followed club on campus. This success is a testament to our relentless efforts in organizing a wide range of engaging events and collaborations. Our flagship events, such as *Flames of Games*, which focuses on mental health through fun mini-games like flip tic-tac-toe, and the ever-popular *IPL Auction*, have drawn considerable attention from sports enthusiasts. Fashion Crave has also become a campus highlight, showcasing the creativity and style of our members, leading to the highly anticipated Fashion Walk. Beyond these signature events, we've built valuable collaborations with other organizations, further increasing our reach and providing the campus community with exciting, interactive experiences both online and offline.",
    "president_email": "pranav.raj.22cse@bmu.edu.in",
    "vp_email": "palak.wadhwani.23cse@bmu.edu.in",
    "flagship_events": "IPL Auction\r\nFlames of Games\r\nFashion Crave",
    "insta": "https://www.instagram.com/smc.bmu?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw=="
  },
  {
    "uid": 5,
    "name": "Insights Club ",
    "logo": "",
    "motto": "To create a fully student driven initiative that allows learning by sharing, experience, and application of a large variety of skills in conjunction with teamwork, where innovation is met by encouragement and enhanced by more ideas.",
    "club_email": "insights@bmu.edu.in",
    "phone": 7379121659,
    "about": "The Insights Club at BML Munjal University (BMU) is the official MBA student body responsible for organizing a range of activities, events, and workshops. Focused on fostering a practical and holistic learning environment, the club provides students with numerous opportunities to enhance their managerial, analytical, and leadership skills beyond the classroom. Through these initiatives, the Insights Club plays a vital role in nurturing well-rounded MBA graduates who are prepared to tackle the complexities of the corporate world with confidence, creativity, and a strong sense of professionalism.",
    "whyus": "Joining the Insights Club at BML Munjal University offers a unique opportunity for MBA students to enhance their academic journey with practical skills and experiences. The club focuses on fostering holistic development by providing hands-on learning through workshops, events, and industry interactions that help members apply classroom concepts to real-world scenarios. It also promotes leadership and collaboration, giving students the chance to organize and manage events, sharpening their managerial and teamwork abilities. Members benefit from networking opportunities with industry professionals and alumni, staying updated on current business trends while cultivating critical thinking and problem-solving skills. With a focus on preparing students for the complexities of the corporate world, the Insights Club equips its members with the tools and experiences necessary for career advancement and long-term success.",
    "milestones": "A key milestone for the Insights Club is establishing itself as the go-to platform for simulating real-world corporate experiences for students. By consistently organizing events that mirror the challenges and opportunities of professional life, the club has solidify its reputation as an essential part of the MBA journey. ",
    "president_email": "kadumbari.mohan.23mb@bmu.edu.in",
    "vp_email": "sakshi.sheoran.23mb@bmu.edu.in",
    "flagship_events": "Corporate Roadies ",
    "insta": "https://www.instagram.com/insights.club.bmu?igsh=MXg1cG03anprYzZreA=="
  },
  {
    "uid": 6,
    "name": "PAC - Photography & CInematography Club",
    "logo": "",
    "motto": "Turning Moments into Masterpieces",
    "club_email": "pac@bml.edu.in",
    "phone": 6281297050,
    "about": "The Photography and Cinematography (PAC) Club is a vibrant community of creative minds passionate about capturing moments and telling stories through the lens. Our club brings together enthusiasts from diverse backgrounds who share a common love for photography, videography, and post-production editing. Whether it's covering college events, conducting workshops, or hosting competitions, we provide a platform for our members to explore their creative potential and sharpen their technical skills.\r\n\r\nPAC offers opportunities to learn and grow in various aspects of visual storytelling, including ideation, shooting, and editing. We believe in fostering a collaborative environment where members can experiment with new techniques, share knowledge, and work on exciting projects. Our mission is to cultivate a supportive and inspiring space for all students, whether they are seasoned photographers or beginners eager to learn.\r\n\r\nThrough our work, we aim to not only document important moments but also create impactful narratives that resonate with the community. Join us in shaping the world one frame at a time!",
    "whyus": "Joining the Photography and Cinematography (PAC) Club offers a unique opportunity to explore your creativity while honing technical skills in photography, videography, and editing. Whether you're a beginner eager to learn or a seasoned creator, PAC provides a supportive environment where you can experiment, collaborate, and grow. You’ll have access to workshops, hands-on projects, and exciting events that push your artistic boundaries. Plus, by covering major campus events, you’ll get real-world experience while building an impressive portfolio.\r\n\r\nMore than just a club, PAC is a community of passionate individuals who share your love for visual storytelling. It’s a chance to network with like-minded peers, work on meaningful projects, and contribute to impactful narratives. If you’re looking to sharpen your skills, unleash your creativity, and make lasting memories, PAC is the place to be!",
    "milestones": "Successfully covered major university events, capturing memorable moments through photography and videography.\r\nHosted multiple workshops on photography and videography, providing hands-on learning for students.\r\nCollaborated with various departments and student bodies to offer professional-level event coverage.\r\nOrganized internal competitions like \"SnapQuest\" and \"Capture through your lens\" to foster creativity and skill development.",
    "president_email": "grithika.varma.22bbl@bmu.edu.in",
    "vp_email": "bayyapureddy.vibhugnan.23cse@bmu.edu.in",
    "flagship_events": " Photowalk",
    "insta": "https://www.instagram.com/pac.bmu?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==",
    "linkedin": "https://www.linkedin.com/company/photography-cinematography-club/"
  },
  {
    "uid": 7,
    "name": "ACM BMU Student Chapter",
    "logo": "",
    "motto": "Let's make cool stuff happen!",
    "club_email": "acm@bmu.edu.in",
    "phone": 8826427240,
    "about": "ACM BMU is the official student chapter of ACM, the world’s largest computing society at BMU. We are a student-driven body and are one of the most active clubs on campus. We conduct a host of varied technical events throughout the year, from workshops and talks by industry experts to hackathons, monthly coding contests and more.\r\n\r\nWe aim to organize exciting events and foster a sense of innovation and creativity among computer enthusiasts, and in the process develop a community with a single driving force: passion. Passion for programming, problem-solving, research, and team engagement.\r\n\r\nWe welcome students of all backgrounds, interests, and skill levels to join our community and share our love for technology. Our events are open to everyone, regardless of major or experience!\r\n\r\nWelcome to ACM BMU! Let’s make cool stuff happen!",
    "whyus": "Joining the ACM BMU Student Chapter offers numerous benefits. It helps students develop technical skills through workshops, coding competitions, and hackathons, while gaining insights into industry trends via guest lectures and events. Members build a valuable network of professionals and peers, enhancing career prospects. Leadership roles within the chapter allow students to develop organizational and teamwork skills, boosting their resumes. The chapter also fosters a collaborative environment with team-based challenges and promotes career advancement through resume-building workshops and mock interviews. ACM BMU is an inclusive community that supports growth for all members, offering a competitive edge in the tech world.",
    "milestones": "300+ Members On-Campus and over 20 members across the country.\r\n\r\nHackBMU 5.0 attracted 1200+ participants from 13 different countries.\r\n\r\nSuccessfully organized Six Editions of HackBMU, BMU's flagship hackathon.\r\n\r\nHosted Four Editions of the Smart India Hackathon, fostering innovation at a national level.\r\n\r\nBMU's Only Internationally Licensed Technical Community, offering global exposure and opportunities.\r\n\r\nACM BMU Research Wing has represented the chapter in 7 universities worldwide since its inception.\r\n\r\nProud host of the largest technical events at BMU, bringing together students, experts, and innovators.",
    "president_email": "aditya.rastogi.22cse@bmu.edu.in",
    "vp_email": "shrey.jaiswal.23cse@bmu.edu.in",
    "flagship_events": "HackBMU, Research Opportunities in Computer Science (ROCS), ACM Technical Festival & Summit, Smart India Hackathon, Hacked (67th Milestone)",
    "insta": "https://www.instagram.com/acm_bmu/?hl=en",
    "linkedin": "https://www.linkedin.com/company/bmu-acm-student-chapter/",
    "website": "https://acmbmu.com/"
  },
  {
    "uid": 8,
    "name": "Environment Club ",
    "logo": "",
    "motto": "Preserving the planet is our duty—educating, acting, and inspiring sustainable change for future generations.",
    "club_email": "environment@bmu.edu.in",
    "phone": 8320382370,
    "about": "The Environment Club is a dedicated organization focused on fostering environmental awareness and promoting sustainability within our community. Our mission is to educate members about the significance of protecting our planet and the most effective ways to achieve this. We believe that through collective action and education, we can address the pressing environmental challenges of our time.\r\n\r\nThe club actively engages in various initiatives and events that promote eco-friendly practices and raise awareness about critical environmental issues. Notable activities include eco-friendly Ganapati idol-making, where members create idols using sustainable materials, and tree planting drives aimed at enhancing green spaces on campus and in surrounding areas. Our innovative \"Let it Grow\" event promotes seed dispersal using biodegradable balloons, encouraging participants to think about plant growth and restoration creatively.\r\n\r\nThese activities not only educate our members but also provide opportunities for hands-on involvement in environmental projects. By participating in the Environment Club, members develop valuable skills such as leadership, teamwork, and problem-solving while forming lasting connections with like-minded individuals.\r\n\r\nThe Environment Club serves as a platform for individuals to unite in their commitment to protecting the environment and ensuring a healthier planet for future generations.",
    "whyus": "Joining the Environment Club means becoming part of a movement dedicated to making a positive impact on the planet. By becoming a member, you'll have the chance to contribute to meaningful change through raising environmental awareness and taking action on important sustainability issues. It's a space where you can grow personally and develop valuable skills such as leadership, teamwork, and problem-solving, all while working toward a greener future. The club allows you to connect with like-minded individuals who share a passion for protecting the environment, creating a supportive community driven by a common goal. If you're passionate about making a real difference and being part of a movement that strives for a more sustainable world, the Environment Club is the perfect place for you.",
    "milestones": "The Environment Club has achieved several significant milestones in its mission to promote sustainability and environmental awareness on campus. One of the key accomplishments is the successful organization of monthly plantation drives, resulting in the planting of numerous trees that contribute to a greener campus. The club's \"Green Ganesha Idol Making\" event has become a standout initiative, encouraging students to use eco-friendly materials during the Ganesh Chaturthi festival. The innovative \"Let it Grow\" event, where seeds are dispersed through biodegradable balloons, has fostered creative thinking around seed dispersal and environmental restoration.",
    "president_email": "shreya.gupta.22bb@bmu.edu.in",
    "vp_email": "vaishnavi.singh.23cse@bmu.edu.in",
    "flagship_events": "1. Green Ganesha Idol Making\r\nAn annual event held during Ganesh Chaturthi where participants create eco-friendly Ganesh idols using clay, seeds. \r\n\r\n2.Let it Grow\r\nAn innovative event where seeds are placed inside balloons and released  As the balloons deflate or pop, the seeds are naturally dispersed, promoting plant growth.\r\n\r\n3.Flora Hunt 2.0 \r\na unique way to explore the plantations on our campus🌳🌳\r\nA fun and engaging treasure hunt with an environmental twist. Participants solve clues and complete eco-themed challenges, learning about tree in campus.\r\n\r\n4.Monthly Plantation Drives\r\nA recurring event held every month, focusing on planting trees and enhancing green spaces around the campus and nearby.",
    "insta": "https://www.instagram.com/invites/contact/?i=sa2wjiscsica&utm_content=3y09uy8",
    "linkedin": "https://www.linkedin.com/company/environment-club-bmu"
  },
  {
    "uid": 9,
    "name": "LiQuiD",
    "logo": "",
    "motto": "Prajnanam Brahma",
    "club_email": "liquid@bmu.edu.in",
    "phone": 7738866311,
    "about": "LiQuiD, the Literary, Quizzing, and Debating club, is more than just a community of readers, debaters and quizzers —it’s a passionate and determined family that thrives on curiosity, creativity, and connection. At LiQuiD, we create spaces for students to dive into deep conversations, express themselves, and challenge their thinking, all while having fun (and sipping tea at times!).\r\n\r\n\r\nOur events cater to diverse interests, making the club a dynamic hub for book lovers, trivia enthusiasts, and debate aficionados. The Freshers' Debate is a highlight, offering first year students the chance to explore different topics and issues through meaningful debates, all while honing their speaking skills. Another flagship event, Chai Pe Charcha, invites participants to discuss pressing topics that matter to today’s generation, fostering meaningful dialogue and the exchange of diverse perspectives.\r\n\r\n\r\nFor literature enthusiasts, the Book Club offers a platform for thoughtful discussions, while our Open Mic events encourage members to share their words—whether poetry, prose, or spoken word. The Freshers’ Quiz invites both seasoned trivia enthusiasts and newcomers alike to participate in a fun fast-paced competition, making learning fun. Whether you're a trivia pro or someone exploring something new, LiQuiD provides the support and encouragement to help students excel.\r\n\r\n\r\nAt its heart, LiQuiD is about more than just events—it’s about building a community that values ideas, dialogue, and shared experiences. We encourage every member to bring their unique perspective and help shape our growing, ever-evolving family.",
    "whyus": "Joining LiQuiD offers a unique opportunity to be part of a vibrant community that values curiosity, dialogue, and creativity. Whether you’re a quiet thinker, a confident debater, or someone who thrives in a creative space, LiQuiD offers you a chance to grow. Through open mics, quizzes, debates, and discussions, we help members sharpen their communication, critical thinking, and collaboration skills. \r\n\r\nBeyond the events, LiQuiD is about building friendships with like-minded individuals who are passionate about learning and growing together. The club is a supportive and welcoming community that brings together students who are curious, passionate, and ready to explore new ideas. It’s a space to express yourself, challenge your assumptions, and build friendships with like-minded peers. Whether you're passionate about literature, quizzing, or debating, the club offers diverse opportunities for personal growth and building a strong, like-minded community.",
    "milestones": "LiQuiD has achieved significant milestones that reflect its growing influence and popularity on campus. The club's flagship events, such as the Freshers' Debate and Chai Pe Charcha, have become highly anticipated, drawing large participation and engaging students in meaningful discussions on contemporary issues. Another exciting flagship event under our belt is the Freshers' Quiz, designed for trivia enthusiasts and newcomers alike, offering encouragement and support to help students excel. LiQuiD has also expanded its Book Club, attracting a diverse group of literature enthusiasts who regularly participate in discussions on various genres and authors. Additionally, the club's Open Mic events have created a supportive platform for students to express their creativity through poetry, storytelling, and spoken word, further solidifying a creative community. These milestones not only showcase LiQuiD’s successful events but also demonstrate its role in fostering intellectual growth, creativity, and collaboration among students from different disciplines.",
    "president_email": "amishi.shrivastava.22bbl@bmu.edu.in",
    "vp_email": "suvarnagauri.kalbag.23bbl@bmu.edu.in",
    "flagship_events": "LiQuiD's flagship events:\r\n\r\nFreshers' Debate – Debate\r\nChai Pe Charcha – Dialogue\r\nFreshers' Quiz – Trivia\r\nOpen Mic – Expression\r\nUnscripted – Extempore\r\nThe LiQuiD Times: आपके ख़यालों से हमारे पन्नों तक – Newsletter",
    "insta": "https://www.instagram.com/liquid_bmu/"
  },
  {
    "uid": 10,
    "name": "Enactus BMU",
    "logo": "",
    "motto": "People, Planet & Profit !!!",
    "club_email": "enactus.bmu@bmu.edu.in",
    "phone": 6299455620,
    "about": "Enactus BMU is a student-led organization at BMU that empowers students to make a positive impact on society through entrepreneurial projects. We believe in the power of innovation and collaboration to address real-world challenges and create sustainable solutions.",
    "whyus": "Develop Leadership Skills: Gain valuable experience in leadership, teamwork, and project management.\r\nMake a Positive Impact: Contribute to meaningful projects that address social and environmental issues.\r\nNetwork with Industry Professionals: Connect with industry leaders and explore career opportunities.\r\nEnhance Your Resume: Gain practical skills and experiences that will make you stand out in the job market.",
    "milestones": "1. Ideathon (Flagship Event) - 435 participants amongst 1800 students of BMU.\r\n2. Bizzy Bash - We got 70+ registrations within a span of 2 days. \r\n3. Pitchfest (Supporting Partner)- We achieved a great Good Word of Mouth during the event.\r\n4. Sanitary Napkin Campaign - We were able to distribute 100 Sanitary Napkins at Connaught Place, Delhi",
    "president_email": "nishant.patel.23mb@bmu.edu.in",
    "vp_email": "harshit.vyas.23bb@bmu.edu.in",
    "flagship_events": "1.      Ideathon (Flagship Event)\r\n2.      Bizzy Bash\r\n3.      Spreading Happiness Campaign (Charity Work in collaboration with NSS)\r\n4.      Pitchfest (in collaboration with ACIC)\r\n5.      Sanitary Napkin Campaign\r\n6.      Donation Drive\r\n7.      Project Roshni & many more!",
    "insta": "https://www.instagram.com/enactusbmu?igsh=c3RndWdkeDdiam1y",
    "linkedin": "https://www.linkedin.com/company/enactus-bmu-2024"
  },
  {
    "uid": 11,
    "name": "Wellness & Fight Club",
    "logo": "",
    "motto": "Health, Strength, Unity, Spirit",
    "club_email": "wnfclub@bmu.edu.in",
    "phone": 9999821333,
    "about": "The Wellness and Fight Club offers a unique approach to personal growth by blending physical fitness with mental well-being. Its primary goal is to empower individuals through activities like boxing, fitness training, and mental health awareness programs, promoting a balanced lifestyle. These initiatives help members build physical strength while also enhancing resilience, confidence, and mental clarity.\r\nBoxing, one of the club’s key elements, not only improves physical endurance, discipline, and coordination but also serves as an effective stress management tool. By providing a healthy outlet to release energy, it helps members manage stress in a controlled and positive way. Alongside physical training, the club emphasizes mental wellness, offering sessions on mindfulness, emotional intelligence, and stress management to support members in their overall well-being.\r\nWhat truly distinguishes the Wellness and Fight Club is its strong sense of community. Members encourage and support each other through challenges, fostering a safe, inclusive environment where open discussions about mental health are welcomed. This supportive atmosphere allows individuals to share experiences, learn from one another, and grow collectively. The club also hosts events, workshops, and guest talks to further promote mental and physical wellness, inspiring members to adopt a holistic approach to life.\r\n\r\nBy focusing on both mind and body, the Wellness and Fight Club cultivates not just physical fitness, but also a culture of overall well-being, personal development, and mental resilience.",
    "whyus": "Joining the Wellness and Fight Club offers an opportunity to focus on both physical fitness and mental well-being. Whether you're looking to improve your physical strength through activities like boxing or seeking strategies to manage stress and anxiety, the club provides a supportive environment for personal growth. You'll have access to fitness training, mindfulness workshops, and mental health sessions that promote resilience, confidence, and emotional balance.\r\n\r\nThe club ensures that members support each other, fostering strong connections and mutual encouragement. Additionally, the club regularly hosts engaging events, guest talks, and activities that allow members to learn, grow, and challenge themselves both physically and mentally. If you're passionate about maintaining a healthy body and mind while being part of a positive, inclusive community, this club is a perfect fit!",
    "milestones": "Since its inception, the Wellness and Fight Club has achieved significant milestones by hosting boxing workshops, fitness sessions, and mental health awareness programs, building a community focused on physical and emotional well-being. The club’s mindfulness workshops and stress management sessions have helped members build emotional strength. Key achievements include events like guest talks and wellness seminars, where fitness and mental health experts interact with members. By taking part in campus-wide wellness events and forming partnerships, the club has grown its presence and impact. It has become a key place for promoting both physical and mental well-being, helping members achieve balanced personal growth.",
    "president_email": "manish.sharma.23mb@bmu.edu.in",
    "vp_email": "yakshita.yadav.23cse@bmu.edu.in",
    "flagship_events": "NA",
    "insta": "https://www.instagram.com/wellnessfight.club_bmu/?hl=en",
    "linkedin": "https://www.linkedin.com/company/wellness-fight-club-bmu/posts/?feedView=all"
  },
  {
    "uid": 12,
    "name": "TSEC - The Startup And Entreneurship Club ",
    "logo": "",
    "motto": "Inspiring Ideas, Empowering Entrepreneurs",
    "club_email": "tsec.club@bmu.edu.in",
    "phone": 9971100527,
    "about": "The Startup and Entrepreneurship Club (TSEC) is a dynamic community dedicated to fostering entrepreneurial spirit and innovation. We provide a supportive environment where aspiring entrepreneurs can connect with like-minded individuals, gain valuable mentorship, and develop essential business skills. Our mission is to empower students to pursue their entrepreneurial dreams and contribute to economic growth. We offer a variety of resources, including workshops, guest lectures, and networking events, to equip members with the knowledge and tools needed to succeed. Through our collaborative approach, we aim to create a vibrant ecosystem where entrepreneurship thrives and innovation flourishes.",
    "whyus": "Joining The Startup and Entrepreneurship Club (TSEC) offers an incredible opportunity to develop entrepreneurial skills, gain hands-on experience, and network with like-minded individuals. Whether you're passionate about launching your startup or simply curious about the entrepreneurial world, the club provides valuable resources, mentorship, and guidance. You'll enhance critical thinking, problem-solving, and leadership abilities through workshops, talks by successful alumni, and real-world challenges. The club is a great platform for collaborating with peers, exchanging innovative ideas, and working on exciting projects that foster creativity and business acumen.",
    "milestones": "One of the key milestones our Startup and Entrepreneurship Club achieved was representing our institution at IIT Madras, where our team had the privilege to showcase the club's vision and initiatives on a national platform. We also successfully hosted an International EIS Conference, where scholars, professionals, and entrepreneurs from diverse fields presented their research papers, facilitating insightful discussions on innovation and entrepreneurship. In addition, we recently collaborated with the E-Cell of IIT Bombay for a high-stakes Pitching Competition, further strengthening our presence in the startup ecosystem. These achievements reflect our commitment to fostering entrepreneurial spirit, facilitating knowledge exchange, and providing our members unparalleled opportunities to engage with leading minds in business and innovation.",
    "president_email": "aditi.agrawal.22bb@bmu.edu.in",
    "vp_email": "kartik.mehtani.23cse@bmu.edu.in",
    "flagship_events": "Eis Conference , Innovation Day",
    "insta": "https://www.instagram.com/tsec_ecellbmu?igsh=MXg1Y3hudHowMjlhcQ==",
    "linkedin": "https://www.linkedin.com/company/the-start-up-entrepreneurship-club-ecell-bmu/"
  },
  {
    "uid": 13,
    "name": "Sierra",
    "logo": "",
    "motto": "Innovate, Discuss, Game & Grow: Building a Revolutionary Tomorrow.",
    "club_email": "sierra@bmu.edu.in",
    "phone": 9958257072,
    "about": "The name \"Sierra\" comes from the Spanish word \"mountain range,\" which contains strength and stability along with the journey towards higher aspirations. This fits very well within what Sierra Club is all about: a student-led organisation that allows students to step into the world of leadership and collaboration through dynamic and engaging events.\r\nWhat does Sierra bring to the table? Well, a variety of flagship events where students, thought leaders, and change makers interact with one another. This includes TEDx, which invites innovative thinkers to share groundbreaking ideas on a wide range of matters, while the Hult Prize remains as one of its flagship events, a global entrepreneurship competition designed to inspire young minds into creating sustainable, profit-driven solutions to some of the world's greatest challenges. This competition includes levels such as campus, regional, and global, which allows students to situate impact in real-life applications. BML Munjal Model United Nations or BMU MUN is also part of Sierra's lineup. It promotes diplomacy and negotiation skills for its members while granting them awareness of the world.\r\nApart from the major flagship events, there are many monthly events like the Sierra 1UP is a monthly eSports event for the club, while the Sierra Diplomacy Forum is also held where deeper critical discussion of diplomacy and policies around the globe can occur. Academic focus is also enhanced through the Monthly Discussion Forum, where topics such as AIPPM and global issues are discussed. Each of these events not only provides a discourse platform but also enhances the abilities of public speaking, negotiation, and leadership.\r\nSierra has variety in all initiatives, developing students to grow into outstanding, international-minded individuals to be the change.",
    "whyus": "Sierra stands out as an exceptional club dedicated to fostering both personal and professional growth through an extensive array of clubs and events. Each activity is thoughtfully designed to cater to diverse interests, enabling students to develop unique skills and enhance their personalities.\r\n\r\nAmong its flagship events, the Hult Prize challenges students to propose innovative solutions to pressing global issues, cultivating entrepreneurial spirit and sharp decision-making abilities. Another major event, The Model United Nations (MUN) provides a vital platform for students to engage in diplomacy, improving their negotiation skills while promoting global citizenship. The third is the TEDx events featuring esteemed speakers, facilitating active global discussions and offering invaluable insights.\r\n\r\n\r\nAdditionally, Monthly events, such as Sierra 1UP for gaming enthusiasts and the Sierra Diplomacy Forum for discussing current affairs, enrich the college experience.\r\n\r\nIn all, Sierra empowers students to explore their passions, cultivate leadership skills, and make meaningful contributions to society, ensuring a well-rounded educational journey.",
    "milestones": "Sierra Club has marked its presence as a hub of innovation, leadership, and diverse engagement. \r\nOur major accomplishments include:\r\nHult Prize Success: Since 2017, Sierra has successfully organised the prestigious Hult Prize On Campus. In 2018, the winners from our university represented their ideas in Singapore, competing with participants from over 100 countries. The following year, our team advanced to the Dubai regional stage, showcasing their entrepreneurial spirit on a global platform. Hult Prize On Campus continues to thrive from 2017 to 2024, as we step into the 8th edition in 2025.\r\n\r\nTEDx: In collaboration with TEDx, Sierra has brought inspiring speakers to our campus. Notable speakers include Gaurav Mehta, CMO of Noise; Shariq Patel, CBO of Zee Studios; Rohit Gulati, Director of Marketing at Johnson & Johnson; Deepak Gupta, Co-founder and COO of Bombay Shaving Company; and Ankur Warikoo, renowned entrepreneur and public speaker.\r\n\r\nSierra Diplomacy Forum (SDF): Through the Sierra Diplomacy Forum, we host All India Political Parties Meet (AIPPM) and monthly discussions on socio-political and geopolitical issues. SDF gives students a platform to dive deep into global affairs, honing their diplomacy and leadership skills.\r\n\r\n1UP Gaming Community: Sierra’s 1UP gaming community has become a centrepiece for student engagement in the eSports space. We regularly organise competitive gaming events with 100+ participants in popular titles such as BGMI, Valorant, and FIFA, creating thrilling experiences for gamers across campus.\r\n\r\nModel United Nations (MUN): Sierra took a major step forward in 2024 by hosting BML Munjal University’s first edition of MUN, creating an inclusive platform for students to engage in diplomatic discussions and address global issues. This initiative firmly established Sierra’s leadership in the realm of international relations.\r\n\r\nCollaborative Events: Sierra continuously works in collaboration with other university clubs to organise impactful and innovative events, fostering a culture of teamwork and shared leadership across campus.",
    "president_email": "manasag.v.22bbl@bmu.edu.in",
    "vp_email": "bhavyanshi.singh.23mec@bmu.edu.in",
    "flagship_events": "1. Hult Prize\r\n2. TedX \r\n3. BMU Model United Nations\r\n4. Money Muffin",
    "insta": "https://www.instagram.com/sierra.bmu?igsh=cGxrOWZ3MWFiaDlz&utm_source=qr",
    "linkedin": "https://www.linkedin.com/company/clubsierra-bmu/"
  },
  {
    "uid": 14,
    "name": "Savera",
    "logo": "",
    "motto": "Together we can make a difference. ",
    "club_email": "savera@bmu.edu.in",
    "phone": 6304402400,
    "about": "Savera is a community service club dedicated to transforming the lives of underprivileged children through holistic education. Our mission is to break the cycle of poverty by empowering young minds with knowledge, mentorship, and life skills. Every day, we offer educational classes and fun, interactive activities designed to spark curiosity and inspire creativity among the children we serve.\r\n\r\nAt Savera, we believe in nurturing not only academic growth but also the overall development of the children, helping them build the confidence to reach their full potential. Through workshops, events, trips, and games, we create an environment where they can explore their talents and develop essential social skills. By volunteering with Savera, you're not just contributing to education; you're joining a family that is committed to making a tangible difference in society. Together, we work toward creating a brighter future, one child at a time. \"Together, we can make a difference.\"",
    "whyus": "At Savera, we believe in the power of small actions to create a ripple of change. When you join us, you’re not just giving your time — you’re giving hope to children who dream of a brighter future. These children look to us not just for education, but for inspiration, support, and belief in their potential. Every smile you bring to their faces, every new thing they learn because of you, is a step towards breaking the barriers of poverty and inequality. The bond you build with these children becomes a light in their lives, guiding them toward a path they might have never seen otherwise.\r\n\r\nBeyond the emotional impact, being a part of Savera allows you to grow in ways you never imagined. You’ll develop leadership, teamwork, and communication skills as you take on responsibilities that directly impact the lives of underprivileged children. These experiences not only leave you with a deep sense of fulfillment but also help build a strong resume, showcasing your commitment to social causes, problem-solving abilities, and ability to work in diverse environments. Joining Savera is more than just volunteering; it’s an opportunity to challenge yourself, to learn, and to be part of a community that fosters real change. Together, we can help these children rise above their challenges, while you build the skills and experiences that will stay with you for life.",
    "milestones": "Savera has achieved several significant milestones that reflect its growth and impact. The club secured sponsorship from Dell and Youth for Sewa, two reputable organizations that recognized Savera’s commitment to education and community service. This support has allowed the club to expand its activities and provide better resources to underprivileged children. Additionally, Savera has collaborated with Kshitij… Where Dream Meets Reality, a renowned poetry organization based in Delhi, supporting their promotional event. This collaboration not only extended Savera's reach but also connected the club with like-minded organizations, furthering its mission of making a positive difference. ",
    "president_email": "sairam.adityakasarla.22cse@bmu.edu.in",
    "vp_email": "ayushi.sharma.23bll@bmu.edu.in",
    "flagship_events": "Krystal\r\nTrip",
    "insta": "https://www.instagram.com/savera_bmu?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==",
    "linkedin": "https://www.linkedin.com/company/saverabmu/"
  },
  {
    "uid": 15,
    "name": "Mritunjaya - The Theatre Society",
    "logo": "",
    "motto": "PASSION. PERFORMANCE. PERFECTION| मञ्चः मम् ईश्वरः, अभिनय मम् प्रार्थनाः ।",
    "club_email": "mrityunjaya@bmu.edu.in",
    "phone": 8586811185,
    "about": "Mrityunjaya Theatre Society is a family of passionate storytellers. It crafts narratives that make audiences laugh, cry, and escape daily life. The strength of Mrityunjaya lies in collaboration, mutual support, and shared joy, whether through tea after rehearsals or dinners post-performances.\r\nThe purpose of Mrityunjaya, is to provide a creative platform for students to explore and express their talents in various areas such as acting, directions, script writing, stage management and more. It fosters a collaborative environment for producing theatrical performances, including plays, nukkad nataks, and stage shows, both within the college and in external competitions. The society also aims to promote cultural awareness, social messaging, and personal growth by encouraging members to engage in meaningful and impactful storytelling through drama.\r\nMrityunjaya revives stories and inspires souls, offering practical experience and networking for aspiring theatre professionals. The club family is like a train, welcoming new members and bidding farewell to others, all carrying forward their legacy of creativity and camaraderie.\r\n",
    "whyus": "Joining Mrityunjaya Theatre Society offers more than just an opportunity to act, it's an invitation to become part of a creative and supportive family of passionate and likeminded individuals. The society is not just looking for actors, it welcomes anyone with a passion for storytelling, creativity or a will to perform on stage and get rid of your stage fear. Whether you're interested in directions, script writing, set design, music, dance, audio visuals or backstage management, the society offers diverse roles that cater to different talents. \r\nIt’s a space where everyone can contribute, from the technical aspects of lighting and sound to the creative process of bringing a script to life. Theatre enhances invaluable life skills like communication, confidence, problem-solving, and empathy. \r\nMrityunjaya gives you practical experiences that go beyond the stage, preparing you for diverse challenges in life. Mrityunjaya fosters collaboration, personal growth, and mutual support, with every rehearsal and performance strengthening bonds between members.\r\n",
    "president_email": "chinmay.srivastava.22cse@bmu.edu.in",
    "vp_email": "kavya.sekhar.23bbl@bmu.edu.in",
    "flagship_events": "Ram Leela, Mahabharat, Hero Forever",
    "insta": "https://www.instagram.com/mrityunjaya_theatresociety?igsh=ZWpmaWJ1anB0MzRr"
  },
  {
    "uid": 16,
    "name": "NSS BMU",
    "logo": "",
    "motto": "Not Me, But You",
    "club_email": "nss.bmlmunjaluniversity@bmu.edu.in",
    "phone": 8074096269,
    "about": "The National Service Scheme (NSS) is a Central Sector Scheme of Government of India, Ministry of Youth Affairs & Sports. It provides opportunity to the student youth of 11th & 12th Class of schools at +2 Board level and student youth of Technical Institution, Graduate & Post Graduate at colleges and University level of India to take part in various Government led community service activities & programmes. \r\nNSS was launched in 1969 in 37 Universities involving about 40,000 volunteers which has now spread over 657 Universities and 51 +2 Councils/Directorates, covering 20,669 Colleges/ Technical Institutions and 11,988 Senior Secondary School. Since inception , over 7.4 crore students have benefitted from NSS.\r\n\r\nThe main objectives of the volunteers of National Service Scheme BMU (NSS BMU) are :\r\ni. understand the community in which they work\r\nii. understand themselves in relation to their community\r\niii. identify the needs and problems of the community and involve them in problem-solving\r\niv. develop among themselves a sense of social and civic responsibility\r\nv. utilize their knowledge in finding practical solutions to individual and community problems\r\nvi. develop competence required for group living and sharing of responsibilities\r\nvii. gain skills in mobilizing community participation\r\nviii. acquire leadership qualities and democratic attitudes\r\nix. develop the capacity to meet emergencies and natural disasters and\r\nx. practice national integration and social harmony",
    "whyus": "In terms of professional life and ECC:\r\n1) Potentially earn full marks in ECC\r\n2) Chance to achieve a government certificate for social service.\r\n3) Give back to the community and receive credits at the same time.\r\n\r\nBeing an active member the volunteers would have the exposure and experience to be the following:\r\n1) An efficient Administrator\r\n2) An accomplished leader\r\n3) A person who understands Human Nature",
    "milestones": "The National Service Scheme (NSS) at BML Munjal University has reached remarkable milestones through its heartwarming and impactful events. \r\nNSS Gramotsav has become a beacon of rural development, with over 200 enthusiastic volunteers visiting villages to spread knowledge about sustainable agriculture and the wonders of millets.  \r\nSpreading Smiles united our college community in a beautiful act of generosity, as students donated clothes and shoes, proving that small acts of kindness can create ripples of joy.\r\nDiwali Dil Se was a heartfelt tribute to our unsung heroes—the supporting staff—bringing festive cheer and gratitude to those who keep our campus running smoothly. \r\nLastly, Harmony of Generations bridged the gap between young and old, as students brought laughter and companionship to a local old age home, creating unforgettable memories.\r\nThese milestones showcase NSS's unwavering dedication to community service, sustainability, and fostering a compassionate, inclusive environment. Each event  inspired a lasting spirit of community involvement and social responsibility.",
    "president_email": "duvvurisai.vardhani.22bb@bmu.edu.in",
    "vp_email": "punya.mahajan.23cse@bmu.edu.in",
    "insta": "https://www.instagram.com/nss_bmu/",
    "linkedin": "https://in.linkedin.com/company/nssbmu"
  },
  {
    "uid": 17,
    "name": "Strokes",
    "logo": "",
    "motto": "\"From the mind to canvas, we dare\" ; \"The palette of infinite possibilities\"",
    "club_email": "strokes@bmu.edu.in",
    "phone": 8584866961,
    "about": "Strokes is more than just an art club—it's a vibrant space where creativity comes alive, and members get the chance to really dive into their passion for art. The club organizes a wide range of events, workshops, and competitions, giving everyone, no matter their skill level, a chance to try something new and grow as an artist. One of our favorite events was held during Ganesh Chaturthi, where participants created beautiful clay Ganesh murtis from scratch and then painted them. It was a hands-on experience that taught everyone the joy of working with clay while also developing their painting skills.\r\n\r\nAnother highlight is \"Fluidise,\" where participants use liquid colors to create stunning abstract works on canvas. It's a fun, free-flowing way to express yourself without worrying too much about perfection—just letting the colors blend and take shape on their own.\r\n\r\nBy joining Strokes, members don’t just learn art techniques—they build confidence in their abilities. The workshops cover everything from sketching and painting to more unique forms of art, like digital design and sculpting, so there’s always something new to explore. What makes the club truly special is the supportive community. Everyone’s here to work hard, have fun, and push each other to get better. The events are a mix of learning, experimenting, and enjoying the process, so by the end, not only do you improve your skills, but you also walk away with a sense of pride and accomplishment.\r\n\r\nMost of all, being part of Strokes is just a fun experience. It’s a place to be yourself, unleash your creativity, and make great memories with people who love art as much as you do.",
    "whyus": "Joining Strokes offers a chance to dive into your creativity while being part of a welcoming and supportive community. Whether you're a seasoned artist or just starting out, Strokes provides a space where you can learn, grow, and experiment with different styles and techniques. Through workshops, collaborative projects, and events, you'll have plenty of opportunities to improve your skills and share your work. More than just an art club, Strokes is a place to meet new people who share your passion and can inspire you along the way. You'll get the chance to participate in exhibitions, competitions, and art showcases that give you a platform to express yourself and build confidence in your work. Being part of Strokes means joining a creative family where everyone is encouraged to explore, create, and inspire.",
    "milestones": "We have achieved major participation this year , with increase in no of majors and minors and a lott of enthusiasm by the students keep us motivated to currate even more wonderful events.",
    "president_email": "manasvi.22cse@bmu.edu.in",
    "vp_email": "khushi.bansal.23bbl@bmu.edu.in",
    "flagship_events": "The Fine Arts Marathon",
    "insta": "https://www.instagram.com/strokes_bmu?igsh=eG9menB0cHF2dnBs"
  },
  {
    "uid": 18,
    "name": "BMU Robotics Club",
    "logo": "",
    "motto": "Empowering innovation through robotics, fostering creativity, collaboration, and hands-on learning for all.",
    "club_email": "bmuroboticsclub@bmu.edu.in",
    "phone": 7011829682,
    "about": "The Robotics Club is a thriving community of tech enthusiasts focused on the exciting world of robotics and automation. Our mission is to provide a platform where students can collaborate, innovate, and transform their ideas into real, functioning robots. Whether you're a beginner eager to learn or an experienced builder, the club offers an inclusive environment that fosters curiosity and the development of practical skills.\r\n\r\nWe regularly organize workshops, hands-on sessions, and competitions that teach the fundamentals of electronics, mechanics, and programming. Our projects range from building simple Arduino-based robots to creating advanced systems using Raspberry Pi and ESP-32. Additionally, we explore the integration of AI and IoT into robotics, ensuring that our members gain cutting-edge skills relevant to the rapidly changing tech industry.\r\n\r\nCollaboration is at the heart of everything we do. Members work in teams, share knowledge, and support each other in solving complex problems. We also invite industry professionals to deliver expert talks and conduct specialized training sessions, keeping our members up-to-date with the latest technologies and trends.\r\n\r\nThe Robotics Club is more than just about building robots; it’s about developing crucial skills like problem solving, creativity, teamwork, and leadership. By participating in our activities, you'll not only build impressive projects but also gain valuable soft skills essential for your future career. Join us and be a part of a dynamic community that’s pushing the boundaries of innovation through technology!",
    "whyus": "Joining the Robotics Club offers an exciting opportunity to dive into robotics and technology, no matter your experience level. If you’re passionate about innovation, problem-solving, and hands-on learning, this is the perfect place for you. You'll develop practical skills in electronics, programming, and mechanics through engaging projects and workshops focused on technologies like Arduino, Raspberry Pi, and IoT.\r\n\r\nThe club also provides the chance to participate in thrilling competitions such as Robo War, Robo Soccer, Robo Race, Aerial Drones, Line Followers, and Sumobot. These events challenge your creativity, test your technical skills, and give you a platform to showcase your innovations.\r\n\r\nBeyond technical expertise, the club fosters collaboration, teamwork, and leadership. Working alongside like-minded peers and learning from experienced mentors, you'll develop solutions to real-world challenges while boosting your confidence and creativity. Join us and build a solid foundation for a future career in technology, engineering, or any field that thrives on innovation!",
    "milestones": "The Robotics Club has reached numerous milestones through diverse events and initiatives. Signature competitions like Robo War, Robo Soccer, Robo Race, Aerial Drones, and Line Followers have drawn wide participation, reflecting the creativity and technical prowess of our members. The club has achieved outstanding success at prestigious fests such as IIT Guwahati, IIT Hyderabad, BITS Pilani, and NIT Warangal, securing top positions in competitions like Burnout, Drift King, Mini GP, and Full Throttle.\r\n\r\nWorkshops on emerging technologies, including Arduino, Raspberry Pi, and IoT, have further enhanced members' hands-on expertise. Programs like the Aeromodelling Bootcamp and Arduino101 have provided students with invaluable experience in drone construction and robotics.\r\n\r\nBy partnering with industry professionals, the club has offered members mentorship and exposure to the latest innovations in the field, keeping them ahead in the fast-changing tech landscape. These milestones reflect the Robotics Club's dedication to nurturing innovation, collaboration, and practical learning, making it an essential platform for developing technical and creative skills on campus.",
    "president_email": "ishika.kochhar.22cse@bmu.edu.in",
    "vp_email": "deepanshu.goyal.23cse@bmu.edu.in",
    "flagship_events": "RWOC (Robotics Winter of Code)\r\nRoboWar",
    "insta": "https://www.instagram.com/bmuroboticsclub/",
    "linkedin": "https://www.linkedin.com/company/bmu-robotics-club/"
  },
  {
    "uid": 19,
    "name": "Adventure Club ",
    "logo": "",
    "motto": "When adventure calls, we answer! ",
    "club_email": "adventureclub@bmu.edu.in",
    "phone": 7995268885,
    "about": "Our club is more than just about adrenaline—it's about forging connections with like-minded explorers, pushing boundaries, and expanding your horizons.\r\nWe believe life is best lived outside the comfort zone, where every turn holds a new surprise and every moment is an opportunity to grow. At the heart of our club is a deep appreciation for the natural world. We believe that spending time outdoors can have a profound impact on our physical, mental, and emotional well-being. Whether you're seeking solitude, camaraderie, or simply a chance to escape the hustle and bustle of daily life, the Adventure Club offers a welcoming and supportive environment. Our members come from all walks of life, but they share a common love for exploration and a desire to push their boundaries. \r\nWe trek, we cycle, we camp, we travel, we shower under waterfalls, we jump over hurdles and we’re growing each day! ",
    "whyus": "Whether you're a seasoned thrill-seeker or someone looking to dip their toes into the world of exploration, we welcome all with open arms. \r\nYou'll learn new skills, conquer your fears, and discover strengths you never knew you had.\r\nHere, we transform ordinary weekends into extraordinary adventures, creating unforgettable experiences that fuel your spirit and ignite your passion for the outdoors. \r\nSo, if you're ready to trade routine for excitement and discover a world full of untamed possibilities, Adventure Club is your gateway to the ultimate thrill!",
    "milestones": "The Adventure Club has achieved several notable milestones in last few year. Our recent trip to Kasol was a resounding success, offering participants an unforgettable experience in the mountains. 40 trekkers from our club scaled the Kheerganga mountain, camped at 0 degrees on top of a mountain and showered under chilling waterfalls!\r\nOur highlight event of last year was - Catch me if you can (Recreation of WORLD CHASE TAG) an exhilarating, fast-paced sport that combines the thrill of parkour with the classic game of tag. Participants navigated a specially designed arena, filled with obstacles like hurdles, low bars and platforms, allowing them to showcase their agility and creativity as they chase and evade opponents.\r\nParticipation in Triathlon exceeded our expectations every year! The event unfolded in three stages: the German Drill, cycling, and a brisk 100- meter sprint. Adrenaline pumped in participants and spectators alike.\r\nThese accomplishments reflect the club’s commitment to promoting adventure, fitness, and collaboration among students, making it one of the most dynamic groups on campus. We look forward to continuing this momentum with more exciting activities in the future.",
    "president_email": "madhujesselynn.mazel.22bbl@bmu.edu.in",
    "vp_email": "parth.bansal.23bb@bmu.edu.in",
    "flagship_events": "Official university trip, Triathlon, Adventure sports",
    "insta": "https://www.instagram.com/adventure_club_bmu?igsh=MXh0NDVycGxjNXQ1dw="
  },
  {
    "uid": 20,
    "name": "Culinary",
    "logo": "",
    "motto": "Where Flavor Meets Passion",
    "club_email": "culinary.club@bml.edu.in",
    "phone": "77993 00070",
    "about": "Welcome to the Culinary Club, a vibrant community dedicated to food lovers, aspiring chefs, and culinary enthusiasts! Our club brings together individuals from diverse backgrounds to share their love for cooking, explore exciting new recipes, and celebrate the art of cuisine. Whether you're an experienced cook or just starting your culinary journey, the Culinary Club provides a welcoming environment to learn, create, and savor the joy of food.\r\n\r\nAt the core of our club is the belief that cooking is more than just meal preparation—it’s an avenue for creative expression, cultural celebration, and building meaningful connections. We offer a wide range of activities, including interactive cooking workshops, recipe swaps, culinary competitions, and themed food events. Through these experiences, our members can sharpen their cooking skills, discover unique flavors, and immerse themselves in global culinary traditions.\r\nOur mission is to cultivate a community where food serves as a medium for learning, bonding, and enjoyment. We encourage members to experiment with ingredients, share their favorite dishes, and collaborate in cooking experiences. From mastering basic techniques to exploring gourmet cuisine, the Culinary Club offers something for everyone.\r\nWhether you're aspiring to be a professional chef or simply enjoy cooking with friends, the Culinary Club is the perfect space to explore your culinary passion and create delicious memories!",
    "whyus": "Joining the Culinary Club offers a chance to enhance your cooking skills, explore global cuisines, and express your creativity in the kitchen. Whether you're a beginner or a seasoned cook, the club provides hands-on workshops, cooking challenges, and themed events where you can learn new techniques and experiment with ingredients. It’s also a great way to meet like-minded people, bond over shared meals, and be part of a vibrant community. Through fun competitions and recipe exchanges, you’ll improve your culinary abilities while expanding your palate and discovering diverse flavors. Additionally, the club promotes healthy eating and personal growth, helping you gain confidence, develop patience, and create wholesome, delicious meals. Joining the Culinary Club is the perfect recipe for learning, connection, and culinary fun!",
    "milestones": "The culinary club has achieved several milestones under its leadership. We've organized multiple successful events, including cooking competitions, workshops, and guest chef demonstrations, all fostering hands-on learning and culinary creativity. The club expanded its member base, fostering a strong community of food enthusiasts. We collaborated with local restaurants, providing members with industry exposure and networking opportunities. We conducted  charity event, raising funds through a bake sale. These achievements have not only enhanced members' culinary skills but also strengthened teamwork, leadership, and organizational capabilities, contributing to the club's growing reputation within and beyond campus.",
    "president_email": "noonesurya.karthikeyan.22ece@bmu.edu.in",
    "vp_email": "sirisha.kolluru.23cse@bmu.edu.in",
    "flagship_events": "Master Chef",
    "insta": "https://www.instagram.com/bmuculinaryclub/",
    "linkedin": " https://www.linkedin.com/company/culinary-club-bmu/"
  },
  {
    "uid": 21,
    "name": "SATA",
    "logo": "",
    "motto": "Create, Connect and Collaborate! ",
    "club_email": "sata@bmu.edu.in",
    "phone": 8950549580,
    "about": "At SATA (Science and Technology Appreciation Club), we create an engaging and supportive environment where students can explore and deepen their understanding of coding-based technologies. Whether you're looking to master a technology you’ve always been passionate about or seeking a space to present your innovative ideas, SATA offers the resources and encouragement to help you grow and succeed.\r\n\r\nOur aim is to ignite a passion for coding and technology by fostering a spirit of collaboration and creativity. Through hands-on workshops, stimulating discussions, and exciting hackathons, we offer students the chance to build meaningful connections while learning and experimenting with new concepts. SATA is a community where curiosity is nurtured, and ideas are brought to life, with individuals supporting each other in both their challenges and success.\r\n\r\nWe also stay at the cutting edge of emerging technologies, guiding students with the knowledge and skills needed to thrive in an ever-changing tech world. Through collaborative projects and skill-building initiatives, SATA empowers students to apply their coding expertise in real-world scenarios, providing not just education, but experiences that inspire innovation and personal growth.",
    "whyus": "The Science and Technology Appreciation Club (SATA) is all about sparking interest in coding and driving students to explore the endless possibilities in the tech world. From interactive workshops to thrilling hackathons, SATA encourages students to actively participate in diverse programming activities that enhance both skills and creativity.\r\n\r\nWith a focus on collaboration and innovation, SATA offers a space where students can expand their coding knowledge and put their ideas into action. Whether you're new to coding or looking to sharpen your abilities, the club provides opportunities to experiment, learn, and thrive in today’s rapidly evolving tech landscape.\r\n\r\nCreate, Connect and Collaborate : Join SATA!!",
    "milestones": "Hosted Four Editions of the On Campus Smart India Hackathon(SIH). \r\n\r\nHub for GSoC for 3 consecutive years. \r\n\r\nHosted various workshops led by industry experts. \r\n\r\nCo-Hosted Hacked for 2 consecutive years.",
    "president_email": "gaurangi.22cse@bmu.edu.in",
    "vp_email": "tanya.23cse@bmu.edu.in",
    "insta": "https://www.instagram.com/sata_bmu?igsh=NGs3NXNzcjlxdGFo ",
    "linkedin": "https://www.linkedin.com/company/sata-ai/mycompany/ "
  },
  {
    "uid": 22,
    "name": "Automobile club",
    "logo": "",
    "motto": "Drive Your Passion, Ignite Your Future!",
    "club_email": "automobile.club@bmu.edu.in",
    "phone": 7678698129,
    "about": "The University Automobile Club is a vibrant community for automotive enthusiasts, students, and anyone interested in the world of cars. Our mission is to foster a passion for all things automotive while providing a platform for learning, networking, and hands-on experience. Whether you’re a seasoned gearhead or just starting to explore the automotive landscape, our club offers something for everyone.\r\n\r\nMembers participate in a variety of activities, including workshops on car maintenance, restoration projects, and educational seminars featuring industry professionals. We also organize group outings to car shows, races, and auto expos, allowing members to experience the thrill of the automotive world firsthand.\r\n\r\nCollaboration is at the heart of our club. We encourage teamwork through projects, where members can work together to build or modify vehicles, enhancing their skills and camaraderie. Additionally, we host guest speakers and panel discussions to keep our members informed about the latest trends and technologies in the automotive industry.\r\n\r\nJoin us to fuel your passion, meet like-minded individuals, and embark on an exciting journey through the fascinating world of automobiles. Together, we drive towards innovation, knowledge, and unforgettable experiences!",
    "whyus": "Hands-On Experience: Gain practical skills through workshops and projects, from basic maintenance to complex restorations.\r\n\r\nNetworking Opportunities: Connect with fellow enthusiasts, industry professionals, and alumni who share your passion and can provide valuable insights and career advice.\r\n\r\nEducational Resources: Attend seminars and guest lectures that cover the latest trends, technologies, and career paths in the automotive field.\r\n\r\nFun Events: Participate in car shows, races, and club outings that combine excitement and camaraderie, allowing you to share your passion with others.\r\n\r\nTeamwork and Collaboration: Work on group projects that build teamwork skills and foster lasting friendships within the club.\r\n\r\nCreative Expression: Explore your creativity through automotive design, modifications, and restorations, making each project uniquely yours.\r\n\r\nCommunity Engagement: Get involved in local automotive events and charity initiatives, making a positive impact while enjoying your passion.\r\n\r\nJoining the University Automobile Club is more than just a hobby—it's a gateway to personal growth, lifelong friendships, and a deeper understanding of the automotive world!",
    "milestones": "Milestones Achieved by the BMU Automobile Club\r\nNational Competition Victory: Winning a prestigious national automotive competition, showcasing the club's technical expertise and teamwork.\r\n\r\nSuccessful Annual Car Show: Organizing a highly successful annual car show that attracted participants and attendees from across the region, raising funds for local charities.\r\n\r\nCollaborative Projects: Completing a major collaborative project, such as building a car from scratch or restoring a vintage vehicle, demonstrating members' skills and commitment.\r\n\r\nWorkshops and Training Programs: Hosting a series of workshops that saw record participation, equipping members with essential skills in automotive repair and maintenance.\r\n\r\nIndustry Partnerships: Establishing partnerships with leading automotive companies, providing members with internships, job opportunities, and exclusive resources.\r\n\r\nGuest Speaker Series: Launching a successful guest speaker series featuring prominent figures in the automotive industry, enhancing members' knowledge and networking opportunities.\r\n\r\nCommunity Outreach: Engaging in impactful community service projects, such as automotive education programs for local schools or charity vehicle repairs.\r\n\r\nSustainability Initiatives: Implementing eco-friendly initiatives, such as promoting electric vehicles or sustainable practices within the club and its events.",
    "president_email": "yogesh.soni.21mec@bmu.edu.in",
    "vp_email": "anshul.23mec@bmu.edu.in",
    "flagship_events": "SAE effique\r\nDiagnosing Electronics: Failure Analysis for Computing, Mobile Networking\r\nGanesh Chaturthi crafting the divine",
    "insta": "https://www.instagram.com/bmu_automobile_club?igsh=MXZ1OWg5aGlwNXBlZw=="
  },
  {
    "uid": 23,
    "name": "Scientific and Computational Mathematics (Sci-Mat)",
    "logo": "",
    "motto": "Your Gateway to Scientific Brilliance. ",
    "club_email": "sci-mat@bmu.edu.in",
    "phone": 8222002540,
    "about": "The Scientific and Mathematics Society is a dedicated organization committed to fostering a vibrant and engaging environment for students interested in the intersection of science, mathematics, and emerging technologies. Our primary objective is to create a stimulating atmosphere where students can explore these disciplines through a variety of activities and initiatives, equipping them with the skills and knowledge necessary to succeed in the rapidly evolving technological landscape.\r\nBy focusing on areas where mathematics and computing converge, we aim to bridge the gap between theoretical concepts and practical applications, providing students with a solid foundation for their academic and professional careers.\r\nIn addition to our core offerings, we actively seek to incorporate emerging trends and technologies into our curriculum. We organize workshops and seminars on topics such as cryptography, cybersecurity and open source software, ensuring that our members stay at the forefront of technological advancements.\r\nFurthermore, we prioritize mentorship and networking opportunities, encouraging senior members to provide guidance and support to younger students. This fosters a strong sense of community and helps students build valuable relationships that can benefit them throughout their academic and professional journeys. By combining a strong academic foundation with exposure to cutting-edge technologies, the Scientific and Mathematics Society aims to empower students to become innovative and successful leaders in the field of science and technology.",
    "whyus": "The Scientific and Mathematics Society offers a wealth of opportunities for students passionate about science, mathematics and technology. By joining our club, you'll gain a strong foundation in these fundamental subjects through our diverse range of programs. We stay at the forefront of technological advancements, offering workshops on topics like cryptography and open source software to keep you informed about the latest trends. To equip you with practical skills for academic and professional success, we provide hands-on activities and projects that allow you to apply your knowledge. Join a community of like-minded students who share your enthusiasm for science and math, and benefit from the guidance and support of our dedicated senior members. Our club can also help you explore exciting career paths in science, technology, engineering, and mathematics, opening doors to a world of possibilities.",
    "milestones": "The Sci-Mat Club has achieved significant milestones in its journey to promote science and mathematics among tech students. With over 100 majors across all batches, the club has successfully fostered a vibrant community of passionate learners. It has been instrumental in inculcating the importance of science and mathematics within the tech student body, inspiring them to explore the interdisciplinary connections between these fields. A testament to its global reach and impact, the club has organized a successful international hackathon, providing a platform for students to showcase their innovative ideas and collaborate with peers from around the world.",
    "president_email": "aditya.bansal.22cse@bmu.edu.in",
    "vp_email": "priyal.khullar.23cse@bmu.edu.in",
    "flagship_events": "Kaun Banega Crorepati (KBC)",
    "insta": "https://www.instagram.com/scimat_bmu?igsh=NmVzOWIyODZ5Y3dq",
    "linkedin": "www.linkedin.com/in/sci-mat-bmu-069b6a291",
    "website": "https://sites.google.com/view/scimat/"
  },
  {
    "uid": 24,
    "name": "PFA - The Performing Arts Club",
    "logo": "",
    "motto": "कला के रंग, मंच के संग",
    "club_email": "pfa@bmu.edu.in",
    "phone": 8962387880,
    "about": "The Performing Arts Club at BML Munjal University is a vibrant hub for students passionate about dance & music. The club fosters a dynamic environment where talent meets opportunity, encouraging students to express themselves through various art forms. With dance and music as its core pillars, the club organizes workshops, competitions, and events that aim to enhance the skills and creativity of the students. Whether you are looking to refine your technique, explore new styles, or perform on stage, The Performing Arts Club offers a platform for growth, collaboration, and artistic expression. ",
    "whyus": "Joining The Performing Arts Club offers students a unique opportunity to explore and develop their talents in dance and music while becoming part of a creative and supportive community. The club provides a platform for students to express themselves, improve their performance skills, and gain confidence through regular workshops, events, and competitions. Whether you are an experienced performer or a beginner, the club offers mentorship, exposure, and the chance to collaborate with like-minded individuals. Being a member not only enhances your artistic abilities but also builds leadership, teamwork, and event management skills. If you're passionate about the performing arts or simply looking for a fun and engaging way to enrich your university experience, this is the place to be! Join us to be part of a thriving community that celebrates the beauty of performance and self-expression.",
    "milestones": "In 2023, the club proudly secured first prizes in several prestigious competitions, including the Battle of Bags at O.P. Jindal University and the Battle of Bands at Amity University, Gurgaon, as well as a first prize in Duet Singing at O.P. Jindal University. Additionally, we organized one of the largest group dance competitions in the history of the BMU Fest, 67 Milestone, achieving over 40 registrations and facilitating the participation of more than 10 teams.\r\n\r\nOur social media engagement reached new heights, with the Performing Arts Global account garnering over 1.2 million views on Instagram, surpassing the combined reach of all college clubs and the official BMU page. Furthermore, we conducted successful workshops for both dance and music, enabling our college dance team to participate in various intercollegiate competitions.",
    "president_email": "akshat.goyal.23mb@bmu.edu.in",
    "vp_email": "anubhav.jhanwar.23cse@bmu.edu.in",
    "flagship_events": "1. Beat the Street\r\n2. Extravaganza\r\n3. Battle of Bands\r\n4. Jamming Nights",
    "insta": "https://www.instagram.com/pfa_performingarts_bmu?igsh=MWFrcWR1d25qMXp6cw%3D%3D&utm_source=qr"
  }
]